### Sales Analysis
Dune is a reputable global retailer offering selection of products, including accessories, clothing, and phones. With a growing presence in 14 countries and a team of over 70,000 employees, the company prides itself on providing affordable options for everyone. From fashion-forward trendsetters to multi-generational families, Dune strives to offer great essentials and standout styles that cater to a wide range of customers.

As a newly appointed Data Scientist, your first task is to analyze the company's sales data from the previous year and provide actionable insights and recommendations. This analysis will help identify areas of opportunity and inform future business decisions aimed at improving performance and increasing profitability.

### Exploratory Data Analysis (EDA)
Exploratory Data Analysis (EDA) is the process of analyizing and summarizing data in order to gain insights and understanding of the underying patterns and relationships. The main objective of EDA is to identify and explore the main characteristics and patterns of the data, and identify any anomalies or outliers that impact subsequent analysis.

EDA typically incolves a number of steps, including:
1. Data cleaning - Data cleaning involves removing or correcting any errors or inconsistencies in the data, such as missing values or incorrect values.
2. Data visualization - Data visualization techniques are then used to graphically represent the data and identify any trends or patterns.
3. Statistical analysis - Statistical analysis is used to identify any relationships between variables and to test hypothesis about the data. This may involve calculating summary statistics such as mean and standard deviation, and performing tests such as correlation analysis and hypothesis testing.

In [6]:
#pip install missingno

In [1]:
# Import Libraries
import pandas as pd # Data preprocessing
import numpy as np
import matplotlib.pyplot as plt # Data visualization
import seaborn as sns # Data visualization
import missingno as msno # Missing data - Data visualization
import collections as Counter # Counting

In [13]:
# Load Datasets
df = pd.read_csv(r"..\EDA\Dune_Sales_Data.csv")
df.head()

,Date,Customer,Sales Person,Customer_Age,Customer_Gender,State,Product_Category,Sub_Category,Payment Option,Quantity,Unit_Cost,Unit_Price
0,19-Feb-16,High,Segun,29,F,Abia,Accessories,Keyboard,Online,1.0,80.00,109.00
1,20-Feb-16,High,Segun,29,F,Abia,Clothing,Polo shirts,Online,2.0,24.50,28.50
2,27-Feb-16,High,Segun,29,F,Abia,Accessories,Keyboard,Online,3.0,3.67,5.00
3,12-Mar-16,High,Segun,29,F,Abia,Accessories,Keyboard,Online,2.0,87.50,116.50
4,12-Mar-16,High,Segun,29,F,Abia,Accessories,Keyboard,Online,3.0,35.00,41.67

In [14]:
df.tail()

,Date,Customer,Sales Person,Customer_Age,Customer_Gender,State,Product_Category,Sub_Category,Payment Option,Quantity,Unit_Cost,Unit_Price
34862,7-Feb-16,High,Kenny,38,M,Ebonyi,Phones,IPhone,Online,2.0,1160.0,985.50
34863,13-Mar-15,High,Kenny,38,M,Ebonyi,Phones,IPhone,Online,1.0,2049.0,1583.00
34864,5-Apr-15,High,Kenny,38,M,Ebonyi,Phones,IPhone,Online,3.0,683.0,560.67
34865,30-Aug-15,High,Kenny,38,M,Ebonyi,Phones,IPhone,Online,1.0,2320.0,1568.00
34866,NaN,NaN,NaN,38,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN